
## Plan Result (./terraform/github/environments/blog)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2853917859)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.blog.github_branch.this
  * module.blog.github_branch_default.this
  * module.blog.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.blog.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "blog"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.blog.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "blog"
    }

  # module.blog.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "blog"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "blog"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* update a label color (name: ./terraform/github/environments/blog/add-or-update, color: 1d76db): PATCH https://api.github.com/repos/tqer39/private-lab/labels/terraform/github/environments/blog/add-or-update: 404 Not Found []
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":132,"Program":"tfcmt","SHA1":"6887feee6d1bd97fefd0c5f27bc57a7a2dd3909a","Target":"./terraform/github/environments/blog","Vars":{},"WorkflowName":"Terraform - GitHub - Blog"} -->